meshtastic/firmware/firmware/src/platform/nrf52/softdevice/ble_gattc.h
/*
 * Copyright (c) Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
  @addtogroup BLE_GATTC Generic Attribute Profile (GATT) Client
  @{
  @brief  Definitions and prototypes for the GATT Client interface.
 */

#ifndef BLE_GATTC_H__
#define BLE_GATTC_H__

#include "ble_err.h"
#include "ble_gatt.h"
#include "ble_ranges.h"
#include "ble_types.h"
#include "nrf.h"
#include "nrf_error.h"
#include "nrf_svc.h"
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup BLE_GATTC_ENUMERATIONS Enumerations
 * @{ */

/**@brief GATTC API SVC numbers. */
enum BLE_GATTC_SVCS {
    SD_BLE_GATTC_PRIMARY_SERVICES_DISCOVER = BLE_GATTC_SVC_BASE, /**< Primary Service Discovery. */
    SD_BLE_GATTC_RELATIONSHIPS_DISCOVER,                         /**< Relationship Discovery. */
    SD_BLE_GATTC_CHARACTERISTICS_DISCOVER,                       /**< Characteristic Discovery. */
    SD_BLE_GATTC_DESCRIPTORS_DISCOVER,                           /**< Characteristic Descriptor Discovery. */
    SD_BLE_GATTC_ATTR_INFO_DISCOVER,                             /**< Attribute Information Discovery. */
    SD_BLE_GATTC_CHAR_VALUE_BY_UUID_READ,                        /**< Read Characteristic Value by UUID. */
    SD_BLE_GATTC_READ,                                           /**< Generic read. */
    SD_BLE_GATTC_CHAR_VALUES_READ,                               /**< Read multiple Characteristic Values. */
    SD_BLE_GATTC_WRITE,                                          /**< Generic write. */
    SD_BLE_GATTC_HV_CONFIRM,                                     /**< Handle Value Confirmation. */
    SD_BLE_GATTC_EXCHANGE_MTU_REQUEST,                           /**< Exchange MTU Request. */
};

/**
 * @brief GATT Client Event IDs.
 */
enum BLE_GATTC_EVTS {
    BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP = BLE_GATTC_EVT_BASE, /**< Primary Service Discovery Response event.          \n See @ref
                                                              ble_gattc_evt_prim_srvc_disc_rsp_t.          */
    BLE_GATTC_EVT_REL_DISC_RSP,  /**< Relationship Discovery Response event.             \n See @ref ble_gattc_evt_rel_disc_rsp_t.
                                  */
    BLE_GATTC_EVT_CHAR_DISC_RSP, /**< Characteristic Discovery Response event.           \n See @ref
                                    ble_gattc_evt_char_disc_rsp_t.               */
    BLE_GATTC_EVT_DESC_DISC_RSP, /**< Descriptor Discovery Response event.               \n See @ref
                                    ble_gattc_evt_desc_disc_rsp_t.               */
    BLE_GATTC_EVT_ATTR_INFO_DISC_RSP,        /**< Attribute Information Response event.              \n See @ref
                                                ble_gattc_evt_attr_info_disc_rsp_t. */
    BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, /**< Read By UUID Response event.                       \n See @ref
                                                ble_gattc_evt_char_val_by_uuid_read_rsp_t.   */
    BLE_GATTC_EVT_READ_RSP, /**< Read Response event.                               \n See @ref ble_gattc_evt_read_rsp_t. */
    BLE_GATTC_EVT_CHAR_VALS_READ_RSP, /**< Read multiple Response event.                      \n See @ref
                                         ble_gattc_evt_char_vals_read_rsp_t.          */
    BLE_GATTC_EVT_WRITE_RSP, /**< Write Response event.                              \n See @ref ble_gattc_evt_write_rsp_t. */
    BLE_GATTC_EVT_HVX,       /**< Handle Value Notification or Indication event.     \n Confirm indication with @ref
                                sd_ble_gattc_hv_confirm.  \n See @ref ble_gattc_evt_hvx_t. */
    BLE_GATTC_EVT_EXCHANGE_MTU_RSP, /**< Exchange MTU Response event.                       \n See @ref
                                       ble_gattc_evt_exchange_mtu_rsp_t.            */
    BLE_GATTC_EVT_TIMEOUT, /**< Timeout event.                                     \n See @ref ble_gattc_evt_timeout_t. */
    BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE /**< Write without Response transmission complete.      \n See @ref
                                           ble_gattc_evt_write_cmd_tx_complete_t.       */
};

/**@brief GATTC Option IDs.
 * IDs that uniquely identify a GATTC option.
 */
enum BLE_GATTC_OPTS {
    BLE_GATTC_OPT_UUID_DISC = BLE_GATTC_OPT_BASE, /**< UUID discovery. @ref ble_gattc_opt_uuid_disc_t  */
};

/** @} */

/** @addtogroup BLE_GATTC_DEFINES Defines
 * @{ */

