meshtastic/firmware/firmware/src/platform/nrf52/softdevice/ble_gattc.h
/** @defgroup BLE_ERRORS_GATTC SVC return values specific to GATTC
 * @{ */
#define BLE_ERROR_GATTC_PROC_NOT_PERMITTED (NRF_GATTC_ERR_BASE + 0x000) /**< Procedure not Permitted. */
/** @} */

/** @defgroup BLE_GATTC_ATTR_INFO_FORMAT Attribute Information Formats
 * @{ */
#define BLE_GATTC_ATTR_INFO_FORMAT_16BIT 1  /**< 16-bit Attribute Information Format. */
#define BLE_GATTC_ATTR_INFO_FORMAT_128BIT 2 /**< 128-bit Attribute Information Format. */
/** @} */

/** @defgroup BLE_GATTC_DEFAULTS GATT Client defaults
 * @{ */
#define BLE_GATTC_WRITE_CMD_TX_QUEUE_SIZE_DEFAULT                                                                                \
    1 /**< Default number of Write without Response that can be queued for transmission. */
/** @} */

/** @} */

/** @addtogroup BLE_GATTC_STRUCTURES Structures
 * @{ */

/**
 * @brief BLE GATTC connection configuration parameters, set with @ref sd_ble_cfg_set.
 */
typedef struct {
    uint8_t write_cmd_tx_queue_size; /**< The guaranteed minimum number of Write without Response that can be queued for
                                        transmission. The default value is @ref BLE_GATTC_WRITE_CMD_TX_QUEUE_SIZE_DEFAULT */
} ble_gattc_conn_cfg_t;

/**@brief Operation Handle Range. */
typedef struct {
    uint16_t start_handle; /**< Start Handle. */
    uint16_t end_handle;   /**< End Handle. */
} ble_gattc_handle_range_t;

/**@brief GATT service. */
typedef struct {
    ble_uuid_t uuid;                       /**< Service UUID. */
    ble_gattc_handle_range_t handle_range; /**< Service Handle Range. */
} ble_gattc_service_t;

/**@brief  GATT include. */
typedef struct {
    uint16_t handle;                   /**< Include Handle. */
    ble_gattc_service_t included_srvc; /**< Handle of the included service. */
} ble_gattc_include_t;

/**@brief GATT characteristic. */
typedef struct {
    ble_uuid_t uuid;                  /**< Characteristic UUID. */
    ble_gatt_char_props_t char_props; /**< Characteristic Properties. */
    uint8_t char_ext_props : 1;       /**< Extended properties present. */
    uint16_t handle_decl;             /**< Handle of the Characteristic Declaration. */
    uint16_t handle_value;            /**< Handle of the Characteristic Value. */
} ble_gattc_char_t;

/**@brief GATT descriptor. */
typedef struct {
    uint16_t handle; /**< Descriptor Handle. */
    ble_uuid_t uuid; /**< Descriptor UUID. */
} ble_gattc_desc_t;

/**@brief Write Parameters. */
typedef struct {
    uint8_t write_op;       /**< Write Operation to be performed, see @ref BLE_GATT_WRITE_OPS. */
    uint8_t flags;          /**< Flags, see @ref BLE_GATT_EXEC_WRITE_FLAGS. */
    uint16_t handle;        /**< Handle to the attribute to be written. */
    uint16_t offset;        /**< Offset in bytes. @note For WRITE_CMD and WRITE_REQ, offset must be 0. */
    uint16_t len;           /**< Length of data in bytes. */
    uint8_t const *p_value; /**< Pointer to the value data. */
} ble_gattc_write_params_t;

/**@brief Attribute Information for 16-bit Attribute UUID. */
typedef struct {
    uint16_t handle; /**< Attribute handle. */
    ble_uuid_t uuid; /**< 16-bit Attribute UUID. */
} ble_gattc_attr_info16_t;

/**@brief Attribute Information for 128-bit Attribute UUID. */
typedef struct {
    uint16_t handle;    /**< Attribute handle. */
    ble_uuid128_t uuid; /**< 128-bit Attribute UUID. */
} ble_gattc_attr_info128_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP. */
typedef struct {
    uint16_t count;                  /**< Service count. */
    ble_gattc_service_t services[1]; /**< Service data. @note This is a variable length array. The size of 1 indicated is only a
                                        placeholder for compilation. See @ref sd_ble_evt_get for more information on how to use
                                        event structures with variable length array members. */
} ble_gattc_evt_prim_srvc_disc_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_REL_DISC_RSP. */
typedef struct {
    uint16_t count;                  /**< Include count. */
    ble_gattc_include_t includes[1]; /**< Include data. @note This is a variable length array. The size of 1 indicated is only a
                                        placeholder for compilation. See @ref sd_ble_evt_get for more information on how to use
                                        event structures with variable length array members. */
} ble_gattc_evt_rel_disc_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_CHAR_DISC_RSP. */
typedef struct {
    uint16_t count;            /**< Characteristic count. */
    ble_gattc_char_t chars[1]; /**< Characteristic data. @note This is a variable length array. The size of 1 indicated is only a
                                  placeholder for compilation. See @ref sd_ble_evt_get for more information on how to use event
                                  structures with variable length array members. */
} ble_gattc_evt_char_disc_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_DESC_DISC_RSP. */
typedef struct {
    uint16_t count;            /**< Descriptor count. */
    ble_gattc_desc_t descs[1]; /**< Descriptor data. @note This is a variable length array. The size of 1 indicated is only a
                                  placeholder for compilation. See @ref sd_ble_evt_get for more information on how to use event
                                  structures with variable length array members. */
} ble_gattc_evt_desc_disc_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_ATTR_INFO_DISC_RSP. */
typedef struct {
    uint16_t count; /**< Attribute count. */
    uint8_t format; /**< Attribute information format, see @ref BLE_GATTC_ATTR_INFO_FORMAT. */
    union {
        ble_gattc_attr_info16_t attr_info16[1];   /**< Attribute information for 16-bit Attribute UUID.
                                                       @note This is a variable length array. The size of 1 indicated is only a
                                                     placeholder for compilation.   See @ref sd_ble_evt_get for more information on
                                                     how to use event structures with variable length array members. */
        ble_gattc_attr_info128_t attr_info128[1]; /**< Attribute information for 128-bit Attribute UUID.
                                                       @note This is a variable length array. The size of 1 indicated is only a
                                                     placeholder for compilation. See @ref sd_ble_evt_get for more information on
                                                     how to use event structures with variable length array members. */
    } info;                                       /**< Attribute information union. */
} ble_gattc_evt_attr_info_disc_rsp_t;

/**@brief GATT read by UUID handle value pair. */
typedef struct {
    uint16_t handle;  /**< Attribute Handle. */
    uint8_t *p_value; /**< Pointer to the Attribute Value, length is available in @ref
                         ble_gattc_evt_char_val_by_uuid_read_rsp_t::value_len. */
} ble_gattc_handle_value_t;

