meshtastic/firmware/firmware/src/platform/nrf52/softdevice/ble_gattc.h
/**@brief Event structure for @ref BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP. */
typedef struct {
    uint16_t count;          /**< Handle-Value Pair Count. */
    uint16_t value_len;      /**< Length of the value in Handle-Value(s) list. */
    uint8_t handle_value[1]; /**< Handle-Value(s) list. To iterate through the list use @ref
                                sd_ble_gattc_evt_char_val_by_uuid_read_rsp_iter.
                                  @note This is a variable length array. The size of 1 indicated is only a placeholder for
                                compilation. See @ref sd_ble_evt_get for more information on how to use event structures with
                                variable length array members. */
} ble_gattc_evt_char_val_by_uuid_read_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_READ_RSP. */
typedef struct {
    uint16_t handle; /**< Attribute Handle. */
    uint16_t offset; /**< Offset of the attribute data. */
    uint16_t len;    /**< Attribute data length. */
    uint8_t data[1]; /**< Attribute data. @note This is a variable length array. The size of 1 indicated is only a placeholder for
                        compilation. See @ref sd_ble_evt_get for more information on how to use event structures with variable
                        length array members. */
} ble_gattc_evt_read_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_CHAR_VALS_READ_RSP. */
typedef struct {
    uint16_t len;      /**< Concatenated Attribute values length. */
    uint8_t values[1]; /**< Attribute values. @note This is a variable length array. The size of 1 indicated is only a placeholder
                          for compilation. See @ref sd_ble_evt_get for more information on how to use event structures with
                          variable length array members. */
} ble_gattc_evt_char_vals_read_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_WRITE_RSP. */
typedef struct {
    uint16_t handle;  /**< Attribute Handle. */
    uint8_t write_op; /**< Type of write operation, see @ref BLE_GATT_WRITE_OPS. */
    uint16_t offset;  /**< Data offset. */
    uint16_t len;     /**< Data length. */
    uint8_t data[1];  /**< Data. @note This is a variable length array. The size of 1 indicated is only a placeholder for
                         compilation.  See @ref sd_ble_evt_get for more information on how to use event structures with variable
                         length array members. */
} ble_gattc_evt_write_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_HVX. */
typedef struct {
    uint16_t handle; /**< Handle to which the HVx operation applies. */
    uint8_t type;    /**< Indication or Notification, see @ref BLE_GATT_HVX_TYPES. */
    uint16_t len;    /**< Attribute data length. */
    uint8_t data[1]; /**< Attribute data. @note This is a variable length array. The size of 1 indicated is only a placeholder for
                        compilation. See @ref sd_ble_evt_get for more information on how to use event structures with variable
                        length array members. */
} ble_gattc_evt_hvx_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_EXCHANGE_MTU_RSP. */
typedef struct {
    uint16_t server_rx_mtu; /**< Server RX MTU size. */
} ble_gattc_evt_exchange_mtu_rsp_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_TIMEOUT. */
typedef struct {
    uint8_t src; /**< Timeout source, see @ref BLE_GATT_TIMEOUT_SOURCES. */
} ble_gattc_evt_timeout_t;

/**@brief Event structure for @ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE. */
typedef struct {
    uint8_t count; /**< Number of write without response transmissions completed. */
} ble_gattc_evt_write_cmd_tx_complete_t;

/**@brief GATTC event structure. */
typedef struct {
    uint16_t conn_handle; /**< Connection Handle on which event occurred. */
    uint16_t gatt_status; /**< GATT status code for the operation, see @ref BLE_GATT_STATUS_CODES. */
    uint16_t
        error_handle; /**< In case of error: The handle causing the error. In all other cases @ref BLE_GATT_HANDLE_INVALID. */
    union {
        ble_gattc_evt_prim_srvc_disc_rsp_t prim_srvc_disc_rsp; /**< Primary Service Discovery Response Event Parameters. */
        ble_gattc_evt_rel_disc_rsp_t rel_disc_rsp;             /**< Relationship Discovery Response Event Parameters. */
        ble_gattc_evt_char_disc_rsp_t char_disc_rsp;           /**< Characteristic Discovery Response Event Parameters. */
        ble_gattc_evt_desc_disc_rsp_t desc_disc_rsp;           /**< Descriptor Discovery Response Event Parameters. */
        ble_gattc_evt_char_val_by_uuid_read_rsp_t
            char_val_by_uuid_read_rsp;     /**< Characteristic Value Read by UUID Response Event Parameters. */
        ble_gattc_evt_read_rsp_t read_rsp; /**< Read Response Event Parameters. */
        ble_gattc_evt_char_vals_read_rsp_t char_vals_read_rsp; /**< Characteristic Values Read Response Event Parameters. */
        ble_gattc_evt_write_rsp_t write_rsp;                   /**< Write Response Event Parameters. */
        ble_gattc_evt_hvx_t hvx;                               /**< Handle Value Notification/Indication Event Parameters. */
        ble_gattc_evt_exchange_mtu_rsp_t exchange_mtu_rsp;     /**< Exchange MTU Response Event Parameters. */
        ble_gattc_evt_timeout_t timeout;                       /**< Timeout Event Parameters. */
        ble_gattc_evt_attr_info_disc_rsp_t attr_info_disc_rsp; /**< Attribute Information Discovery Event Parameters. */
        ble_gattc_evt_write_cmd_tx_complete_t
            write_cmd_tx_complete; /**< Write without Response transmission complete Event Parameters. */
    } params;                      /**< Event Parameters. @note Only valid if @ref gatt_status == @ref BLE_GATT_STATUS_SUCCESS. */
} ble_gattc_evt_t;

/**@brief UUID discovery option.
 *
 * @details Used with @ref sd_ble_opt_set to enable and disable automatic insertion of discovered 128-bit UUIDs to the
 *          Vendor Specific UUID table. Disabled by default.
 *          - When disabled, if a procedure initiated by
 *            @ref sd_ble_gattc_primary_services_discover,
 *            @ref sd_ble_gattc_relationships_discover,
 *            @ref sd_ble_gattc_characteristics_discover,
 *            @ref sd_ble_gattc_descriptors_discover
 *            finds a 128-bit UUID which was not added by @ref sd_ble_uuid_vs_add, @ref ble_uuid_t::type will be set
 *            to @ref BLE_UUID_TYPE_UNKNOWN in the corresponding event.
 *          - When enabled, all found 128-bit UUIDs will be automatically added. The application can use
 *            @ref sd_ble_uuid_encode to retrieve the 128-bit UUID from @ref ble_uuid_t received in the corresponding
 *            event. If the total number of Vendor Specific UUIDs exceeds the table capacity, @ref ble_uuid_t::type will
 *            be set to @ref BLE_UUID_TYPE_UNKNOWN in the corresponding event.
 *            See also @ref ble_common_cfg_vs_uuid_t, @ref sd_ble_uuid_vs_remove.
 *
 * @note @ref sd_ble_opt_get is not supported for this option.
 *
 * @retval ::NRF_SUCCESS Set successfully.
 *
 */
typedef struct {
    uint8_t auto_add_vs_enable : 1; /**< Set to 1 to enable (or 0 to disable) automatic insertion of discovered 128-bit UUIDs. */
} ble_gattc_opt_uuid_disc_t;

/**@brief Option structure for GATTC options. */
typedef union {
    ble_gattc_opt_uuid_disc_t uuid_disc; /**< Parameters for the UUID discovery option. */
} ble_gattc_opt_t;

/** @} */

